from datetime import datetime, date
from collections import defaultdict

now = date.today() # Сьогоднішня дата
print(f'Сьогоднішня дата: {now}')
# print(type(now))
print(f'Сьогодні {now.weekday()} день тижня') # Сьогоднішній день тижня від 0 до 6


# Функція, яка виводить список працівників, які святкують день народження на поточному тижні.
def get_birthdays_per_week(path, encoding):
    users = {}  # Створюю словник з іменами і датами народження
    birthday_users = {}  # Словник працівників у кого ДН на цьому тижні.
    # Зчитую з файлу список дат народження та ПІП
    with open(path, encoding=encoding) as f:
        for line in f:
            (birthday, name) = line.rstrip('\n').split('\t')
            users[name] = birthday
            birthday = datetime.strptime(birthday, '%d.%m.%Y').date() # перетворення дат зі строки до типу datatime
            birthday_current_year = date(now.year, birthday.month, birthday.day) # визначення дня народження в поточному році
            # print(birthday_current_year)
            diff = birthday_current_year - date.today() # Визначення кількості днів до дня народження працівника
            # print(diff.days)
            if -2 - now.weekday() <= diff.days < 5 - now.weekday(): # Якщо до дня народження працівника менше тижня, то заносимо його в новий словничок birthday_users
                birthday_users[name] = birthday_current_year.strftime('%A')
            this_week = defaultdict(list)
            for name, day in birthday_users.items():
                this_week[day].append(name)
    print(f'Повний список працівників: {users}') # Видруковую словник users
    print(f'Список працівників, які мають день народження на цьому тижні: {birthday_users}') # Видруковую словник працівників, які мають день народження на цьому тижні, де величина - день тижня

    print(f'На цьому тижні потрібно привітати таких працівників: ')
    print(f'"Понеділок" : {this_week["Saturday"]},{this_week["Sunday"]}, {this_week["Monday"]}')
    print(f'"Вівторок"  : {this_week["Tuesday"]}')
    print(f'"Середа"    : {this_week["Wednesday"]}')
    print(f'"Четвер"    : {this_week["Thursday"]}')
    print(f'"Пятниця"   : {this_week["Friday"]}')

path = "Workers_birthday.txt"
encoding = 'utf-8'
get_birthdays_per_week(path, encoding)



# users = {'Кацал Дмитро Миколайович': '15.04.1975', 'Душенко Олег Степанович': '18.01.1973',
#          'Семчишин Олег Дмитрович': '23.08.1981', 'Лозинський Назар Ігорович': '12.03.1985',
#          'Карпа Оксана Володимирівна': '31.10.1974', 'Козакова Наталія Юріївна': '01.05.1952',
#          'Чорна Олександра Петрівна': '12.11.1972', 'Хижа Маряна Андріївна': '08.08.1982',
#          'Сокач Маріанна Ніколетта': '21.07.1995', 'Романов Євген Олександрович': '13.11.1996',
#          'Кацал Любов Григорівна': '01.01.1947', 'Сливинська Тетяна Григорівна': '27.04.1953',
#          'Корінь Дарія Григорівна': '06.03.1950', 'Сохан Тетяна Василівна': '01.01.1952',
#          'Грева Галина Богданівна': '14.06.1964', 'Гладик Ігор Володимирович': '15.06.1990',
#          'Коковський Тарас Ігорович': '02.04.1986', 'Никируй Михайло Романович': '27.04.1984',
#          'Табін Юрій Любомирович': '23.04.1978', 'Чорний Роман Олегович': '11.11.1979',
#          'Заборовський Володимир Степанович': '15.07.1988', 'Ярема Олег Омелянович': '27.08.1965',
#          'Цись Назар Романович': '03.05.1984', 'Цись Роман Васильович': '17.10.1957',
#          'Вовчак Богдан Андрійович': '13.05.1999', 'Бакович Любомир Васильович': '17.08.1973',
#          'Бичківський Роман Ігорович': '15.10.1994', 'Борик Дмитро Володимирович': '07.11.1998',
#          'Борик Павло Володимирович': '03.05.1994', 'Гусєв Павло Валерійович': '12.07.1993',
#          'Кацал Микола Миколайович ': '21.11.1969', 'Кордуба Ярема Богданович': '24.04.1976',
#          'Кулявець Андрій Михайлович': '04.05.2000', 'Липак Роман Ігорович': '29.04.1989',
#          'Макар Ярослав Орестович': '15.02.1999', 'Омельчук Назар Михайлович': '13.05.1980',
#          'Пашковський Андрій Андрійович': '05.12.1995', 'Попович Андрій Романович': '24.10.1989',
#          'Сливинський Ярема Тарасович': '20.08.1987', 'Тенета Юрій Михайлович': '27.04.1992',
#          'Чорний Михайло Васильович': '01.01.1999', 'Чорний Павло Васильович': '15.03.1994',
#          'Шпєлик Роман Олегович': '28.04.1988'}

# print(f'На цьому тижні потрібно привітати таких працівників: ')
# for day, name in this_week.items():
#     print(f'{day}: {name}')
#
# print(*this_week.items(), sep='\n')
